Dert14/AWS-IoT-Lamps-ESP32/project/main/aws_connection.h
#include <stdio.h>
#include <stdlib.h>
#include <ctype.h>
#include <unistd.h>
#include <limits.h>
#include <string.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "esp_system.h"
#include "esp_wifi.h"
#include "esp_event.h"
#include "esp_log.h"
#include "esp_vfs_fat.h"
#include "driver/sdmmc_host.h"
#include "nvs.h"
#include "nvs_flash.h"
#include "aws_iot_config.h"
#include "aws_iot_log.h"
#include "aws_iot_version.h"
#include "aws_iot_mqtt_client_interface.h"
#include "aws_iot_shadow_interface.h"
#include "driver/gpio.h"
#include <esp_idf_version.h>
#include "led_driver.h"

#ifndef MAIN_AWS_CONNECTION_H_
#define MAIN_AWS_CONNECTION_H_

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 1, 0)
// Features supported in 4.1+
#define ESP_NETIF_SUPPORTED
#endif
static const char *TAG = "shadow";
#define MAX_LENGTH_OF_UPDATE_JSON_BUFFER 300
#define EXAMPLE_WIFI_SSID CONFIG_WIFI_SSID
#define EXAMPLE_WIFI_PASS CONFIG_WIFI_PASSWORD
static EventGroupHandle_t wifi_event_group;
static bool shadowUpdateInProgress;
extern const uint8_t aws_root_ca_pem_start[] asm("_binary_aws_root_ca_pem_start");
extern const uint8_t aws_root_ca_pem_end[] asm("_binary_aws_root_ca_pem_end");
extern const uint8_t certificate_pem_crt_start[] asm("_binary_certificate_pem_crt_start");
extern const uint8_t certificate_pem_crt_end[] asm("_binary_certificate_pem_crt_end");
extern const uint8_t private_pem_key_start[] asm("_binary_private_pem_key_start");
extern const uint8_t private_pem_key_end[] asm("_binary_private_pem_key_end");
bool data_recived;
int led_states[4];

static void event_handler(void*, esp_event_base_t, int32_t , void*);
void ShadowUpdateStatusCallback(const char*, ShadowActions_t , Shadow_Ack_Status_t ,const char*, void*);
void ledtActuate_Callback(const char*, uint32_t ,jsonStruct_t*);
void aws_iot_task(void*);
static void initialise_wifi(void);
void aws_connect();

#endif /* MAIN_AWS_CONNECTION_H_ */
